system/blockMeshDict
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}
vertices
(
  (-0.05 -0.45 -0.05)
  (1.25 -0.45 -0.05)
  (1.25 4.6 -0.05)
  (-0.05 4.6 -0.05)
  (-0.05 -0.45 0.55)
  (1.25 -0.45 0.55)
  (1.25 4.6 0.55)
  (-0.05 4.6 0.55)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (18 69 9) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
