constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1450212;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       1450312;
    }
    pipe1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3218;
        startFace       1450412;
    }
    pipe2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1748;
        startFace       1453630;
    }
    concreteWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          134670;
        startFace       1455378;
    }
    top
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          61648;
        startFace       1590048;
    }
)

// ************************************************************************* //
